# Value Counts

In [1]:
import pandas as pd

In [2]:
# Creamos el Dataframe a partir del dataset en CSV
df = pd.read_csv('titanic.csv', index_col = [0])

In [3]:
# Mostramos el Dataframe
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
# El método value_counts() nos permite contar los elementos
# de una determinada columna agrupándolos por categoría

In [5]:
# Por ejemplo, aplicado en la columna 'Sex' nos indicará cuántos hombres
# y cuantas mujeres hay
df['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [6]:
# Además de mostrar una tabla con los elementos agrupados por categoría,
# También podemos utilizar este método para recuperar el número de elementos
# de una determinada categoría y así poder operar con dicho valor.

# Por ejemplo, para obtener el número de hombres:
df['Sex'].value_counts().male

577

In [7]:
# Y para obtener el número de mujeres:
df['Sex'].value_counts().female

314

In [8]:
# Otro ejemplo: pasajeros por puerto de embarcación:
# C: Cherbourg
# Q: Queenstown
# S: Southampton

df['Embarked'].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [9]:
# El método value_counts() también se puede utilizar para
# obtener la frecuencia relativa de cada categoría
df['Sex'].value_counts(normalize = True)

Sex
male      0.647587
female    0.352413
Name: proportion, dtype: float64

In [10]:
# También podemos obtener el valor numérico para una determinada
# categoría
df['Sex'].value_counts(normalize = True).male

0.6475869809203143

In [11]:
# Si queremos redondear el valor a un número dado de decimales
# podemos utilizar el método round():
df['Sex'].value_counts(normalize = True).male.round(2)

0.65

# Ejercicio
Escribe el codigo necesario que devuelva el porcentaje de pasjeros de cada clase. NOTA: la clase de pasajeros es Pclass: 1, 2, 3.

In [13]:
df['Pclass'].value_counts(normalize = True)

Pclass
3    0.551066
1    0.242424
2    0.206510
Name: proportion, dtype: float64